brodricyoung/nucleo-stm32/ecen260-stm32/Lab8-password_security_system/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DISARM_BUTTON_Pin GPIO_PIN_13
#define DISARM_BUTTON_GPIO_Port GPIOC
#define DISARM_BUTTON_EXTI_IRQn EXTI15_10_IRQn
#define DATA_AVAILABLE_Pin GPIO_PIN_0
#define DATA_AVAILABLE_GPIO_Port GPIOC
#define DATA_AVAILABLE_EXTI_IRQn EXTI0_IRQn
#define DATA0_Pin GPIO_PIN_0
#define DATA0_GPIO_Port GPIOA
#define DATA1_Pin GPIO_PIN_1
#define DATA1_GPIO_Port GPIOA
#define DATA2_Pin GPIO_PIN_4
#define DATA2_GPIO_Port GPIOA
#define KEY_LED_Pin GPIO_PIN_5
#define KEY_LED_GPIO_Port GPIOA
#define R_LED_Pin GPIO_PIN_6
#define R_LED_GPIO_Port GPIOA
#define Y_LED_Pin GPIO_PIN_7
#define Y_LED_GPIO_Port GPIOA
#define DATA3_Pin GPIO_PIN_0
#define DATA3_GPIO_Port GPIOB
#define G_LED_Pin GPIO_PIN_8
#define G_LED_GPIO_Port GPIOA
#define B_LED_Pin GPIO_PIN_9
#define B_LED_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
